import java.util.Scanner;

public class Menu {

    public void exibirMenu() {
        Scanner scanner = new Scanner(System.in);
        int opcao;
        int n;

        do {
            System.out.println("\n" +
                    "\n" +
                    "█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗\n" +
                    "╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝\n" +
                    "\n" +
                    "░██████╗██╗░░░░░██╗███╗░░██╗██████╗░██╗███╗░░██╗░██████╗░  ░██████╗░░█████╗░███╗░░░███╗███████╗\n" +
                    "██╔════╝██║░░░░░██║████╗░██║██╔══██╗██║████╗░██║██╔════╝░  ██╔════╝░██╔══██╗████╗░████║██╔════╝\n" +
                    "╚█████╗░██║░░░░░██║██╔██╗██║██║░░██║██║██╔██╗██║██║░░██╗░  ██║░░██╗░███████║██╔████╔██║█████╗░░\n" +
                    "░╚═══██╗██║░░░░░██║██║╚████║██║░░██║██║██║╚████║██║░░╚██╗  ██║░░╚██╗██╔══██║██║╚██╔╝██║██╔══╝░░\n" +
                    "██████╔╝███████╗██║██║░╚███║██████╔╝██║██║░╚███║╚██████╔╝  ╚██████╔╝██║░░██║██║░╚═╝░██║███████╗\n" +
                    "╚═════╝░╚══════╝╚═╝╚═╝░░╚══╝╚═════╝░╚═╝╚═╝░░╚══╝░╚═════╝░  ░╚═════╝░╚═╝░░╚═╝╚═╝░░░░░╚═╝╚══════╝\n" +
                    "\n" +
                    "█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗█████╗\n" +
                    "╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝╚════╝\n" +
                    "\n");
            System.out.println("[1] Jogar                                      ");
            System.out.println("[2] Ver Ranking                                ");
            System.out.println("[3] Sair                                       ");
            System.out.println("=================================================================================================");
            System.out.print("Opção: ");

            while (!scanner.hasNextInt()) {
                System.out.println("\nOpção inválida. Digite um número.");
                scanner.next();
                System.out.print("Opção: ");
            }

            opcao = scanner.nextInt();
            scanner.nextLine();

            switch (opcao) {
                case 1:
                    // n = dimensoes();
                    // carregarUser();
                    break;
                case 2:
                    // ranking();
                    break;
                case 3:
                    System.out.println("Saindo...");
                    break;
                default:
                    System.out.println("\nOpção inválida. Pressione ENTER para continuar.");
                    scanner.nextLine();
            }
        } while (opcao != 3);
    }
}